code_room/app/controllers/documents_controller.rb

  def create
    @document = Document.new(document_params)
    @document.admin_id = request.path_parameters[:user_id]
    if @document.save
---
INSERT INTO "documents" ("file_name", "content", "admin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def index
    @documents = Document.where(admin_id: request.path_parameters[:user_id])

    if params[:ids]
      ids = JSON.parse(Base64.decode64(params[:ids]))
      @documents = @documents.select { |doc| ids.include?(doc.id) }
---
SELECT "documents".* FROM "documents" WHERE "documents"."admin_id" = $1  [["admin_id", "f68f1281-36e9-418f-9ecd-bdade463b0b4"]]

  def show
    @document = Document.find_by(id: params[:id])
---
SELECT "documents".* FROM "documents" WHERE "documents"."id" = $1 LIMIT $2  [["id", "b1921ab9-7a00-42ce-be52-9e52702dee6a"], ["LIMIT", 1]]

  def update
    @document = Document.find_by(id: params[:id])

    if @document.update(document_params)
---
SELECT "documents".* FROM "documents" WHERE "documents"."id" = $1 LIMIT $2  [["id", "b1921ab9-7a00-42ce-be52-9e52702dee6a"], ["LIMIT", 1]]
UPDATE "documents" SET "content" = $1, "updated_at" = $2 WHERE "documents"."id" = $3  [["content", "This is the content"], ["updated_at", "2021-07-30 01:21:12.952170"], ["id", "b1921ab9-7a00-42ce-be52-9e52702dee6a"]]